/*#include<stdio.h>   컴파일전 stdio.h 헤더 파일을 먼저 실행시킬 것을 선행 처리기에 지시합니다.
#define IN "원의 반지름은 100입니다. \n"  #define 매크로명 자료 -> 프로그램 내에서 매크로명은 자료로 치환하라는 의미
#define PI 3.1415926535
#define AREA(X) (PI*(X)*(X))
#define OUT printf("원의 면적을 구하고 프로그램을 종료합니다. \n")*/
/*void main() {
	printf("%s \n", IN);
	printf("원의 면적은 %10.5f입니다. \n\n", AREA(100));   % 10.5f의 의미는 총 10자리(소수점 ' . '을 포함) 중 소수점 5자리를 포함하여 출력하여야 하며
	                                                      소수점 이하 자릿수가 5자리 미만이면 그대로 출력되고,
	                                                      5자리 이상이면 (5번째 자리에서) 반올림되어 출력됩니다.
	OUT;
}*/


